#pragma once
#include <vector>

template <typename T>
void selection_sort(std::vector<T>& arr) {
    for (std::size_t i = 0; i + 1 < arr.size(); ++i) {// последний элемент можно не обрабатывать он встанет сам тк будет максим
        std::size_t min_idx = i; // предполагаем минимум на поз 1

        for (std::size_t j = i + 1; j < arr.size(); ++j) { // начинаем со следующего элемента после i, потому что arr[i] мы уже назначили мин
            if (arr[j] < arr[min_idx]) { // ссравнение и обновление минимума
                min_idx = j;
            }
        }
        if (min_idx != i) { //если минимум уже на позиции iменять местами не нужно
            T temp = arr[i];
            arr[i] = arr[min_idx]; //записали минимум на место i. Теперь старое arr[i] потеряно из arr, но живо в temp.
            arr[min_idx] = temp; //записали сохранённое старое arr[i] на место min_idx.
        }

        //СОРТИРОВКА ПРОСТЫМ (ПРЯМЫМ) ВЫБОРОМ
    }
}
//На каждом шаге находим минимум в неотсортированной
// части вектора и ставим его в начало этой части.